{
  "title": "Project Proposal",
  "cells": [
    {
      "type": "text",
      "data": "<h1>Overview</h1><h3>Student</h3><div><ul><li>Brian Scott Bohme (A0144436H)</li></ul></div><h3>Supervisor:&nbsp;</h3><div><ul><li>Professor Bruno Bodin</li></ul></div><h3>Title:&nbsp;</h3><div><ul><li><b>Natural User Interfaces for SLAMBench2 Artifacts: Benchmarking Tools, Information Visualization, and Cloud-Based Services on Mobile Platforms</b><b>&nbsp;</b></li></ul></div><h3>Subject Areas:</h3><div><ul><li>Natural User Interfaces&nbsp;</li><ul><li>User Experience</li><li>Platform Development</li><ul><li>Mobile</li></ul></ul><li>Designing Interactive Systems</li><ul><li>Prototyping</li><li>Iterating</li><li>User Research</li></ul><li>Benchmarking Tools&nbsp;</li><ul><li>Optimization</li></ul><li>Data Visualization</li><li>Hardware</li><ul><li>GPU/Device Performance</li></ul><li>Simulataneous Localization and Mapping&nbsp;</li><ul><li>Computer Vision</li></ul></ul><div><br></div></div><div><hr></div><h2><br></h2><h1><br></h1><h1>Scope</h1><div><i>SLAMBench is a SLAM (Simulatenous Localization and Mapping) performance benchmark that combines a framework for quantifying quality-of-result with instrumentation of accuracy, execution time, memory usage and energy consumption.&nbsp;</i>The goal of this project is to meaningfully contribute to SLAMBench by developing interfaces for the benchmarking platform that enchances the user experience, deepens the user’s understanding of meaningful results, and serves as an industry-standard for benchmarking suites. Keen consideration will be placed on creating a natural user interface, robust information visualization, and integration of metrics with cloud-based services (multiple algorithms/datasets without the need to hardcode them into the tool itself). The value of the project is in lessening the effort required to obtain results and insights for a major benchmarking tool that is a key component of robotics and AR systems, while crafting a cutting-edge interface for exploring and utilizing benchmarking artifacts. The final product will be a mobile tool built for SLAMBench2 that integrates multiple algorithms and datasets and outputs relevant data artifacts/visualizations in an intuitive, precise and meaningful manner.</div><div><br></div><div>The main scope of this project will involve:&nbsp;</div><div><ul><li>Understanding the SLAMBench2 tool and the needs of its users</li><li>Developing multiple in-depth prototypes&nbsp;</li><li>Evaluating these prototypes (as per Designing Interactive Systems specification) and iterating upon collected quantitiative/qualitative data&nbsp;</li><ul><li>This will be the most intensive part, which includes multiple lab tests, interviews, experiments, observations, etc.</li></ul><li>Implementing the interface(s), with keen considerations of platform being developed for (i.e. mobile)</li></ul><div>Main considerations to ensure the scope of the project is robust enough include:&nbsp;</div></div><div><ul><li>Efficiency/Performance&nbsp;</li><li>Design&nbsp;</li><li>Intuitiveness (natural user interface research)</li><li>Intrinsic to industry standards of benchmarking platforms.</li></ul><div>The project will also serve as an opportunity to deepen understanding of SLAM/computer vision concepts and algorithms. A large component of the capstone will be a deep exploration into tools such as SLAM, other benchmarking platforms and collaterals such as CMake. Personally, this will be an opportunity to build new skills as per the nature of knowledge and inquiry demanded by the Capstone project.</div></div><div><h2>Challenges</h2><div><ul><li>Fully understanding the SLAMBench2 system with current level knowledge of simulateneous localization and mapping/computer vision</li><ul><li>Working in new languages and environments</li></ul><li>Highlighting depth of work required for this type of interface design&nbsp;</li><li>Alloting enough time to thoroughly work through iterative, agile-based process</li><li>Communicating the higher-level aspects (theory and practice of benchmarking, natural user interface design, etc.) clearly and confidently.</li></ul><div><h2>Considerations</h2><div>While developing the capstone plan, a couple important considerations were already taken into account:</div><div><ul><li>Platform</li><ul><li>When deciding between working on a mobile or web platform, the differences in purposes were highlighted</li><ul><li>The web SLAMBench2 platform is more robust, meant for professional usage (emphasizes calculations, metrics, etc.)</li><li>On the other hand, the mobile platform is more visually-enticing, meant to “show off” results such that you could quickly show others what the tool is doing in an impressive and intuitive manner</li></ul><li>Because my summer internship fell in the latter category of developing natural, beautiful and robust interfaces for the everyday user, I chose to pursue implementing mobile interfaces</li></ul><li>Operating System</li><ul><li>Android provides the clearest/most ensured path because code already exists. While I will still explore the possibilty of implementing an iOS tool (at the very least, document the steps necessary for doing so for future work beyond the scope of the Capstone), I don’t want to derail/diverge from the main scope of the project by being hindered by bridging/compatibility issues that cannot be circumvented, or spend long portions of time learning how to bridge/compile native code. Hence, from the beginning we will stick with an Android focus, which in turn gives opportunity to explore a new environment and platform for my own sake.</li></ul><li>Device</li><ul><li>Because a large part of SLAMBench is measuring artifacts such as execution time and energy consumption, the hardware/device used will be of core relevance. Part of the initial research will be on different devices/GPUs, but it was decided that a cutting-edge device would be a meaningful way to “push the limits” of the tool and truly see the capabilities, hence a new Huawei device will be utilized (ideally with the Kirin 970-980 system-on-a-chip). Using such a device allows the scope of the research to be pushed towards the future, rather than risking the findings/implementations becoming stale with newer technology arriving.</li></ul></ul></div></div></div></div><h1>Time Allocation</h1><h3>September:&nbsp;</h3><div><ul><li>Submit proposal <b>(September 7th)</b></li><li>Solidify knowledge of SLAM and SLAMBench2 alongside elementary readings of CMake <i>(at least 2 weeks)</i></li><li>Collect and document existing state of benchmarking research (for example, current/future benchmarking technologies/interfaces/designs, etc.). Understand breadth and depth of benchmarking tools and identify key components that will be actionable/implementable in the Capstone project <i>(up to 1 week)</i></li><ul><li>This should include some research and insight into hardware’s role (devices, GPUs, etc.)</li></ul><li>Begin natural user interface research and highlight specifics that I want to focus on/implement in the frontend of the Capstone project <i>(up to 1 week)</i></li><li>Important: Document all initial research, plans and resources extensively.</li></ul><h3>October:&nbsp;</h3></div><div><ul><li>Begin work with requisite tools <i>(at least 3 weeks)</i></li><ul><li>Intensive learning of CMake and native Android environment/development <i>(at least 2 weeks)</i></li><li>Hands-on work with the build system of SLAMBench2</li><li>Exploration of possible iOS development <i>(No more than 1 week)</i></li><ul><li>Will it be possible to bridge? Will it require cross compilation?&nbsp;</li></ul></ul><li>Submit milestone 1 <b>(October 19)</b></li><ul><li>Implement modular command line-based interface that highlights basic goal of being able to pick and choose algorithm/dataset, which then outputs results</li><ul><li>This can start with implementation of Kinect Vision algorithm, then expanding to show that the tool is modular <i>(3 weeks, to be done alongside tasks above)</i></li></ul><li>Showcase start of compatibility testing with Android.</li></ul></ul></div><h3>November:&nbsp;</h3><div><ul><li>Continue exploration of tools <i>(No more than 2 weeks)</i></li><ul><li>Hands-on work with Android device&nbsp;</li><li>Tackling collaterals from CMake/Android (C#/C, etc.)</li></ul><li>Submit milestone 2 <b>(November 16)</b></li><ul><li>First frontend prototype(s) exists, with acknowledgement of implementation plans <i>(at least 2 weeks)</i></li><ul><li>Loading datasets/algorithms libraries</li><ul><li>Key question: What does this look/feel like?</li></ul></ul><li>Key considerations of design should be highlighted. This includes the naturalism of the user interface (i.e. a non-expert should be able to use intuitively with little to no instructions) and the mobile design thoughtfully considered</li><ul><li>The mobile platform emphasizes the ability to “show and tell” your results in a fancy, visually-interesting manner, as compared to the desktop version which is more data/analytically driven for professional use.</li></ul></ul></ul><h3>December:&nbsp;</h3></div><div><ul><li>Connecting SLAMBench2 to frontend</li><ul><li>This is the core component of the Capstone and should therefore take the most amount of time</li><li>Focus on Kinect Vision algorithm implementation, then expand to show modularity of interface <i>(2 weeks)</i></li><li>Different datasets should be able to be processed</li><li>After implementing one algorithm, focus should be put on making sure the product is stable and usable (while meeting most design specifications) before moving on to implementing more algorithms.&nbsp;</li></ul><li>Begin iteration/variation process of frontend</li></ul></div><h3>January/February:&nbsp;</h3><div><ul><li>Continue implementation process of frontend <i>(on-going as needed)</i></li><li>Garner and implement feedback&nbsp;<br></li><ul><li>Feedback from other SLAMBench2 researchers/members or public users <i>(at least 2 weeks)</i></li><li>Iterate by implementing feedback and gathering more feedback data <i>(1-2 weeks)</i></li></ul><li>Bug testing, and polishing project for symposium showcase and initial thesis submission.</li></ul></div><h3>March:&nbsp;</h3><div><ul><li>Submit inital thesis <b>(March 22, before 5pm)</b></li></ul></div><div><div><h1>Expectations</h1></div></div><div>The main expectations are highlighted in the milestones above. There are two submitted milestones, and two personal milestones:&nbsp;</div><div><ol><li>Command-line based implementation (submittable report)</li><li>First frontend prototypes exist (submittable report)</li><li>Variations of interfaces done (personal milestone)</li><li>Feedback received and implemented (personal milestone).&nbsp;</li></ol><div>The expectation is that SLAM/SLAMBench is fully realized and understood, and there is a solid, usable interface implemented (i.e. it is better to have a working interface with some clunky elements than an incomplete project).</div></div><h2>Fallback Plans</h2><div>In the event that connecting SLAMBench2 to the frontend (planned for December) is taking longer than expected, the number of iterations/variations on the prototype should be lowered to 1-2 maximum. The amount of feedback gathered and implemented should also be adjusted; priority should be given to receiving feedback from experienced team members/SLAMBench2 researchers over public feedback. Emphasis should be placed on creating a usable interface that highlights good DIS specifications, some natural user interface elements, and strong understanding of benchmarking tools. Extras, such as information visualization and more features, would be ideal, but are discretionary.</div>"
    }
  ]
}